{"topic": "JEE/NEET Lesson", "response_text": "Hello! Welcome to **SQORA**. I'm your tutor, and I'll help you break down Newton's Third Law in a way that’s super easy to remember for your JEE/NEET prep.\n\n### **What is Newton's Third Law?**\n\nIn simple words: **\"To every action, there is always an equal and opposite reaction.\"**\n\nThis means forces always exist in pairs. If Object A exerts a force on Object B, then Object B exerts a force of the same magnitude back on Object A, but in the opposite direction.\n\n---\n\n### **Key Points (Crucial for JEE/NEET)**\n\nTo solve physics problems correctly, you must remember these three \"golden rules\" about the Third Law:\n\n1.  **Different Bodies:** Action and Reaction **never** act on the same body. If they did, the net force would always be zero, and nothing would ever move!\n2.  **Simultaneous:** There is no time lag. The moment you push a wall, the wall pushes you back instantly.\n3.  **Same Nature:** If the action is a gravitational force, the reaction is also a gravitational force. If the action is a contact force (like Normal force), the reaction is also a contact force.\n\n---\n\n### **Examples from Daily Life**\n\n*   **Walking:** When you walk, your foot pushes the ground **backward** (Action). In return, the ground pushes your foot **forward** (Reaction), which allows you to move.\n*   **Recoil of a Gun:** When a bullet is fired forward (Action), the gun pushes back on the shoulder of the shooter (Reaction).\n*   **Swimming:** A swimmer pushes the water backward with their hands (Action), and the water pushes the swimmer forward (Reaction).\n\n---\n\n### **Mathematical Representation**\n\nIf $\\vec{F}_{AB}$ is the force exerted by body **A** on body **B**, and $\\vec{F}_{BA}$ is the force exerted by body **B** on body **A**, then:\n\n$$\\vec{F}_{AB} = -\\vec{F}_{BA}$$\n\n*(The negative sign indicates the opposite direction.)*\n\n---\n\n### **💡 Pro-Tip for Competitive Exams:**\nIn **Free Body Diagrams (FBD)**, many students confuse Newton's Third Law with Equilibrium. \n*   **Equilibrium:** Two forces act on the **same** object and cancel out (Net Force = 0).\n*   **Third Law:** Two forces act on **different** objects and can never cancel each other out.\n\n**Example:** A book resting on a table. The Weight ($mg$) and Normal force ($N$) are **NOT** an action-reaction pair because they both act on the book. The reaction to the book's weight is the book pulling the Earth upward!\n\nHope this clears it up! Do you have any specific problems or FBDs you'd like to discuss?"}