{"topic": "JEE/NEET Lesson", "response_text": "Hello! Newton's Laws of Motion are the **bread and butter of Mechanics**. For JEE and NEET, these laws aren't just definitions—they are tools you will use to solve almost every physics problem.\n\nLet’s break them down simply.\n\n---\n\n### 1. Newton’s First Law: The Law of Inertia\n\n**Definition:** An object will remain at rest or continue to move at a constant velocity unless acted upon by an external unbalanced force.\n\n*   **What it means:** Objects are \"lazy.\" If they are sitting still, they want to stay still. If they are moving, they want to keep moving in a straight line forever.\n*   **Key Concept – Inertia:** This \"laziness\" is called Inertia. **Mass is the measure of inertia.** The more mass an object has, the harder it is to change its state.\n*   **Real-life Example:** When a bus suddenly starts moving, you fall backward. Your lower body moves with the bus, but your upper body wants to stay at rest due to inertia.\n\n---\n\n### 2. Newton’s Second Law: The Law of Force and Acceleration\n\n**Definition:** The rate of change of momentum of an object is directly proportional to the applied force and takes place in the direction of the force.\n\n*   **The Famous Formula:** \n    $$F = ma$$\n    *(Force = mass $\\times$ acceleration)*\n*   **What it means:**\n    1.  If you apply more **Force ($F$)**, the **Acceleration ($a$)** increases.\n    2.  If the **Mass ($m$)** is higher, you need more force to get the same acceleration.\n*   **For JEE/NEET:** Remember that the \"real\" form of this law is $F = \\frac{dp}{dt}$ (Force is the rate of change of momentum). This is very important for \"variable mass\" problems, like a leaking tank or a rocket.\n\n---\n\n### 3. Newton’s Third Law: Action and Reaction\n\n**Definition:** For every action, there is always an equal and opposite reaction.\n\n*   **What it means:** Forces always come in pairs. If Object A pushes Object B, then Object B pushes Object A back with the same amount of force but in the opposite direction.\n*   **CRITICAL POINT for Exams:** The Action and Reaction forces act on **DIFFERENT bodies**. This is why they don't cancel each other out!\n*   **Example:**\n    *   **Walking:** You push the ground backward (Action), and the ground pushes you forward (Reaction).\n    *   **Swimming:** You push the water back (Action), and the water pushes you forward (Reaction).\n\n---\n\n### Summary Table for Quick Revision\n\n| Law | Name | Core Idea | Math/Formula |\n| :--- | :--- | :--- | :--- |\n| **1st Law** | Law of Inertia | Objects resist change in motion. | $F_{net} = 0 \\implies v = \\text{constant}$ |\n| **2nd Law** | Law of Force | Defines how much an object accelerates. | $F = ma$ |\n| **3rd Law** | Action-Reaction | Forces always occur in pairs. | $F_{AB} = -F_{BA}$ |\n\n### A Quick \"Dodo\" Pro-Tip for JEE/NEET:\nWhen solving problems, always draw a **Free Body Diagram (FBD)**. This is just a simple sketch showing all the forces acting on an object. Once you have the FBD, you just apply $F_{net} = ma$ to solve for whatever is missing!\n\nDo you want to try a practice problem on these laws? I'm happy to help!"}