{"topic": "JEE/NEET Lesson", "response_text": "Great question! Rainbows are a beautiful combination of three major physics phenomena: **Refraction, Dispersion, and Internal Reflection.**\n\nFor your JEE/NEET prep, you should think of a **raindrop as a tiny glass prism.**\n\n---\n\n### The 3 Steps to a Rainbow\n\nTo see a rainbow, you need two things: **The Sun behind you** and **Raindrops in front of you.** Here is what happens inside a single drop:\n\n#### 1. Refraction and Dispersion (Entry)\nAs sunlight enters the raindrop, it slows down and bends (this is **Refraction**). But white light is made of 7 colors (VIBGYOR). Each color bends at a slightly different angle—**Violet bends the most, and Red bends the least.** This splitting of light is called **Dispersion**.\n\n#### 2. Internal Reflection\nThe light hits the back surface of the raindrop. If the angle is right, the light doesn't pass through the back; instead, it reflects back inside the drop. \n*(Note for JEE/NEET: In a primary rainbow, this is just a single internal reflection, not necessarily Total Internal Reflection or TIR, though many textbooks simplify it as such.)*\n\n#### 3. Refraction (Exit)\nThe light exits the raindrop, bending one more time as it moves from water to air. This further spreads the colors out, so they reach your eyes as a beautiful arc.\n\n---\n\n### Why is Red on top and Violet at the bottom? (Primary Rainbow)\n\nEven though Violet bends more than Red inside the drop:\n*   **Red light** leaves the drop at an angle of about **$42^\\circ$** relative to your line of sight.\n*   **Violet light** leaves the drop at an angle of about **$40^\\circ$**.\n\nBecause the Red light comes from drops higher up in the sky and Violet from drops lower down, you see **Red at the outer (top) edge** and **Violet at the inner (bottom) edge.**\n\n---\n\n### Fun Fact: The Secondary Rainbow\nSometimes you see a second, fainter rainbow above the first one. This happens because the light reflects **twice** inside the raindrop. \n*   Because of the extra reflection, the **colors are reversed** (Violet is on top, Red is on the bottom).\n*   It is fainter because light loses energy with each reflection.\n\n---\n\n### Summary for Exams:\n1.  **Phenomena involved:** Refraction, Dispersion, and Internal Reflection.\n2.  **Primary Rainbow:** 1 Internal Reflection. Red at $42^\\circ$ (Top), Violet at $40^\\circ$ (Bottom).\n3.  **Secondary Rainbow:** 2 Internal Reflections. Colors reversed.\n4.  **Observer's Position:** Sun must be behind the observer.\n\n**Pro-Tip:** A rainbow is actually a **full circle**! We only see an arc because the ground (horizon) gets in the way. If you were in an airplane, you might see a complete circular rainbow! 🌈\n\nDoes this make the \"bending of light\" clearer for you?"}